
/* General strings */

"OK" = "OK";

"Cancel" = "Cancel";

"Yes" = "Yes";

"No" = "No";


/* Expanded memory setting */

"Expanded Memory Question" = "Changing the memory expansion pack setting will reset the emulator. Do you want to change this setting now?";

"Change" = "Change";

"Don't Change" = "Don't Change";


/* Preferences */

"Preferences" = "Preferences";

"Emulation" = "Emulation";

"Graphics" = "Graphics";


/* Game freeze messages */

"Freeze Select Cartridge" = "Please locate the cartridge this game freeze was created with:";

"Freeze Restore Error" = "There was an error reading the game freeze.";

"Freeze Restore Version Error" = "The game freeze cannot be opened because it was created with a newer version of sixtyforce than this one.";

"Freeze Autosave Disable" = "You have loaded a game freeze. Do you want to disable autosaving?";

"Freeze Autosave Disable Detail" = "Warning: If autosaving is enabled, any saved game stored in the game freeze will replace any autosaved game you have. Autosaving will be disabled until you load a new cartridge.\r";

"Freeze Autosave Disable Button" = "Disable Autosave";

"Freeze Autosave Enable Button" = "Enable Autosave";

"Freeze Default Filename" = "Untitled Game Freeze";


/* Registration messages */

"Registration Welcome" = "Welcome to sixtyforce!";

"Registration Welcome Detail" = "Like sixtyforce? Please register! When you register you'll get autosaving, game freezes and the 'sixtyforce' logo won't appear over your game. Click 'Register Now' and you can have a serial number emailed you to instantly!";

"Registration Try Button" = "OK";

"Registration Buy Button" = "Register Now";

"Registration Save Notice" = "If you register sixtyforce you will be able to save games. Would you like to register now?";

"Registration Invalid" = "Invalid Registration";

"Registration Invalid Detail" = "There is an error with the registration you entered. Please enter everything exactly as it appears in your registration confirmation email and try again.";

"Registration Blacklisted" = "Please don't pirate sixtyforce.";

"Registration Blacklisted Detail" = "If you don't think sixtyforce is worth it, just use a free alternative. Otherwise please reward hard work. If you think it's worth using, it's worth paying for.";


/* Error messages */

"Error Opening File" = "There was an error opening the file.";

"Error Saving File" = "There was an error saving the file.";

"Error Emulator Crashed" = "The software being emulated appears to have crashed.";

"Error Loading Cartridge" = "There was an error loading the cartridge.";

"Error Loading Cartridge Format" = "The cartridge could not be loaded because it is in a format sixtyforce can't use.";

"Error Starting Audio" = "There was an error starting audio output. Sound will be disabled.";

"Error Out of Memory" = "There was an error allocating memory.";


/* Controller window */

"Controller Delete Keyset" = "Are you sure you want to delete the keyset '%@'?";

"Controller Delete Keyset Detail" = "Are you sure you want to delete the keyset '%@'?";

"Controller Delete OK Button" = "Delete";

"Controller Delete Cancel Button" = "Don't Delete";

"Controller Default Keyset Name" = "Default Keyboard";

"Controller Untitled Keyset Name" = "Untitled Keyset";

"Controller HID Generic Device" = "USB Controller";

"Controller HID Generic Element" = "USB Button";


/* Configure controller */

"Configure Window Title" = "Configure \"%@\"";

"Configure Keyboard Help" = "Click on a controller button in the list to set its keyboard key.";

"Configure Keyboard Button Help" = "Press the key on the keyboard you want to use as the %@.";

"Configure HID Help" = "Click on a controller button in the list to set that control for your gamepad or controller.";

"Configure HID Device Help" = "Click on a controller button in the list to set that control for your %@.";

"Configure HID Button Help" = "Press a button or push a joystick in the direction you want to use as the %@.";


/* General interface */

"About Version" = "Version %@";

"About Register" = "Please register to support sixtyforce!";

"About Registered" = "Registered To: %s";

"Menu Switch Rumble Pack" = "Switch Controller to Rumble Pack";

"Menu Switch Memory Pack" = "Switch Controller to Memory Pack";

"Menu Enter Full Screen" = "Enter Full Screen";

"Menu Exit Full Screen" = "Exit Full Screen";

"Freeze" = "Freeze";

"Controller-Button-A" = "A-Button";

"Controller-Button-B" = "B-Button";

"Controller-Button-Z" = "Z-Button";

"Controller-Button-R" = "R-Button";

"Controller-Button-L" = "L-Button";

"Controller-Button-Start" = "Start-Button";

"Controller-Button-C-Up" = "C-Up";

"Controller-Button-C-Down" = "C-Down";

"Controller-Button-C-Left" = "C-Left";

"Controller-Button-C-Right" = "C-Right";

"Controller-Button-D-Up" = "D-Up";

"Controller-Button-D-Down" = "D-Down";

"Controller-Button-D-Left" = "D-Left";

"Controller-Button-D-Right" = "D-Right";

"Controller-Stick-Up" = "Stick-Up";

"Controller-Stick-Down" = "Stick-Down";

"Controller-Stick-Left" = "Stick-Left";

"Controller-Stick-Right" = "Stick-Right";


/* Controller configuration help */

"Controller-Help-Button-A" = "A button";

"Controller-Help-Button-B" = "B button";

"Controller-Help-Button-Z" = "Z button";

"Controller-Help-Button-R" = "R button";

"Controller-Help-Button-L" = "L button";

"Controller-Help-Button-Start" = "Start button";

"Controller-Help-Button-C-Up" = "C-Up button";

"Controller-Help-Button-C-Down" = "C-Down button";

"Controller-Help-Button-C-Left" = "C-Left button";

"Controller-Help-Button-C-Right" = "C-Right button";

"Controller-Help-Button-D-Up" = "D-Pad Up";

"Controller-Help-Button-D-Down" = "D-Pad Down";

"Controller-Help-Button-D-Left" = "D-Pad Left";

"Controller-Help-Button-D-Right" = "D-Pad Right";

"Controller-Help-Stick-Up" = "joystick up";

"Controller-Help-Stick-Down" = "joystick down";

"Controller-Help-Stick-Left" = "joystick left";

"Controller-Help-Stick-Right" = "joystick right";


/* Update messages */

"Update Latest Version" = "You have the latest version of sixtyforce!";

"Update Error Loading" = "There was an error connecting to internet to check for updates.";


/* Beta messages */

"Beta Expired" = "This version of sixtyforce has expired.";

"Beta Expired Detail" = "Please check the sixtyforce website at sixtyforce.com for a more up to date version.";

"Beta Registration Required" = "This beta version of sixtyforce is available to registered users only.";

"Beta Registration Required Detail" = "Please check the sixtyforce website at sixtyforce.com for a non-beta version.";
